Тест_ЗУП_31_КОРП/src/Documents/ЗаявкаНаКомандировку/ЗаявкаНаКомандировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаКомандировку</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоНазначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияНазначения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Цель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсправленныйДокумент</name>
    <type>
      <types>DocumentRef.ЗаявкаНаКомандировку</types>
    </type>
  </attributes>
  <attributes>
    <name>Рассмотрел</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРассмотрения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Enums/СтатусыЗаявокСотрудников/СтатусыЗаявокСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявокСотрудников</name>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>Рассматривается</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>Отозвано</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Documents/ОтменаЗаявкиНаКомандировку/ОтменаЗаявкиНаКомандировку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтменаЗаявкиНаКомандировку</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаСотрудника</name>
    <type>
      <types>DocumentRef.ЗаявкаНаКомандировку</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявокСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Тест_ЗУП_31_КОРП/src/Documents/ЗаявкаНаКомандировку/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, Новый Структура("Ответственный", "Объект.Ответственный"));
		
		ИнициализироватьФорму();
		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ИнициализироватьФорму();
	
	ОбменДаннымиЗарплатаКадры.ПриЧтенииНаСервереДокумента(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанДокументЗаявкаНаКомандировку", , ЭтаФорма);
	
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОповеститьОбИсправленииДокумента(Объект.Ссылка, Объект.ИсправленныйДокумент, ПараметрыЗаписи.РежимЗаписи, "ПериодическиеСведения");
	Оповестить("Запись_ЗаявкаНаКомандировку", ПараметрыЗаписи, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = "ЗаписанДокументЗаявкаНаКомандировку" И Источник.ВладелецФормы = ЭтаФорма)
		Или (ИмяСобытия = "ЗаписанДокументОтменаЗаявкиНаКомандировку" И Источник.ВладелецФормы = ЭтаФорма)
		Или (ИмяСобытия = "ЗаписьДокументаКомандировка" И Источник = ЭтаФорма) Тогда
		ПриПолученииДанныхНаСервере();
	КонецЕсли;
	ИсправлениеДокументовЗарплатаКадрыКлиент.ОбработкаОповещенияИсправленногоДокумента(ЭтотОбъект, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПериодКомандировкиПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПериодКомандировкиПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ОформитьКомандировку(Команда)
	
	СамообслуживаниеСотрудниковКлиент.ОформитьКадровыйПриказ(ЭтаФорма, "Командировка", ДанныеЗаявкиСотрудника(ЭтаФорма));
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКомандировку(Команда)
	
	СамообслуживаниеСотрудниковКлиент.ОткрытьКадровыйПриказ(ЭтаФорма, "Командировка");
	
КонецПроцедуры

#Область ИсправлениеДокументов

&НаКлиенте
Процедура Подключаемый_Исправить(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.Исправить(Объект.Ссылка, "ЗаявкаНаКомандировку");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправлению(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправлению(ЭтаФорма.ДокументИсправление, "ЗаявкаНаКомандировку");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКИсправленному(Команда)
	ИсправлениеДокументовЗарплатаКадрыКлиент.ПерейтиКИсправленному(Объект.ИсправленныйДокумент, "ЗаявкаНаКомандировку");
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отменить(Команда)
	
	ЗначенияЗаполнения = Новый Структура("ЗаявкаСотрудника, ФизическоеЛицо", Объект.Ссылка, Объект.ФизическоеЛицо);
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	ОткрытьФорму("Документ.ОтменаЗаявкиНаКомандировку.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПерейтиКДокументуОтмены(Команда)

	ПараметрыФормы = Новый Структура("Ключ", ЭтотОбъект.ДокументОтменаЗаявки);
	ОткрытьФорму("Документ.ОтменаЗаявкиНаКомандировку.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отозвать(Команда)
	
	ОтозватьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Согласовать(Команда)
	
	СогласоватьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Отклонить(Команда)
	
	ОтклонитьЗаявкуНаСервере();
	
	ОповеститьОбИзменении(Объект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	Параметры.Свойство("РежимМоиЗаявки", РежимМоиЗаявки);
	
	ИсправлениеДокументовЗарплатаКадры.ГруппаИсправлениеДополнитьФорму(ЭтаФорма, Истина, Ложь);
	СамообслуживаниеСотрудников.ГруппаИсправлениеДополнитьФорму(ЭтаФорма);
	
	ПриПолученииДанныхНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриПолученииДанныхНаСервере()
	
	ИсправлениеДокументовЗарплатаКадры.ПрочитатьРеквизитыИсправления(ЭтаФорма, "ПериодическиеСведения");
	Если Не ЭтаФорма.Параметры.Ключ.Пустая() Тогда
		СамообслуживаниеСотрудников.ПрочитатьРеквизитыИсправления(ЭтаФорма);
	КонецЕсли;
	ИсправлениеДокументовЗарплатаКадрыКлиентСервер.УстановитьПоляИсправления(ЭтаФорма, "ПериодическиеСведения");
	
	СамообслуживаниеСотрудников.УстановитьКадровыйПриказЗаявки(ЭтаФорма);
	СамообслуживаниеСотрудников.УстановитьПоляИсправления(ЭтаФорма, КадровыйПриказ);
	
	УстановитьВидимостьЭлементов();
	УстановитьЗначенияНадписей();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементов()
	
	ПриказОформлен = ЗначениеЗаполнено(КадровыйПриказ);
	ЕстьИсправленныйДокумент = ЗначениеЗаполнено(Объект.ИсправленныйДокумент);
	
	ДоступноДобавлениеКомандировок = ПравоДоступа("Добавление", Метаданные.Документы.Командировка);
	ДоступноЧтениеКомандировок = ПравоДоступа("Чтение", Метаданные.Документы.Командировка);
	
	Если Объект.Статус <> Перечисления.СтатусыЗаявокСотрудников.Согласовано Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"КадровыйПриказСтраницы", "ТекущаяСтраница", Элементы.КадровыйПриказПустаяСтраница);
	ИначеЕсли ПриказОформлен И ДоступноЧтениеКомандировок Тогда 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"КадровыйПриказСтраницы", "ТекущаяСтраница", Элементы.КадровыйПриказСтраница);
	ИначеЕсли Не ПриказОформлен И ДоступноДобавлениеКомандировок И Не ЭтаФорма.ДокументОтменен Тогда  		
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"КадровыйПриказСтраницы", "ТекущаяСтраница", Элементы.ВводКадровогоПриказаСтраница);
	Иначе 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"КадровыйПриказСтраницы", "ТекущаяСтраница", Элементы.КадровыйПриказПустаяСтраница);
	КонецЕсли;
	
	СамообслуживаниеСотрудников.УстановитьВидимостьЭлементовЗаявки(ЭтотОбъект, КадровыйПриказ);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначенияНадписей()
	
	Элементы.ОткрытьКомандировку.Заголовок = Строка(КадровыйПриказ);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДанныеЗаявкиСотрудника(Форма)
	
	Объект = Форма.Объект;
	
	ДанныеЗаявки = Новый Структура;
	ДанныеЗаявки.Вставить("ЗаявкаСотрудника", Объект.Ссылка);
	ДанныеЗаявки.Вставить("ФизическоеЛицо", Объект.ФизическоеЛицо);
	ДанныеЗаявки.Вставить("ДатаНачала", Объект.ДатаНачала);
	ДанныеЗаявки.Вставить("ДатаОкончания", Объект.ДатаОкончания);
	ДанныеЗаявки.Вставить("МестоНазначения", Объект.МестоНазначения);
	ДанныеЗаявки.Вставить("ОрганизацияНазначения", Объект.ОрганизацияНазначения);
	ДанныеЗаявки.Вставить("Цель", Объект.Цель);
	ДанныеЗаявки.Вставить("КадровыйПриказИсправленногоДокумента", Форма.КадровыйПриказИсправленногоДокумента);
	
	Возврат ДанныеЗаявки;
	
КонецФункции

&НаСервере
Процедура ПериодКомандировкиПриИзмененииНаСервере()
	
	УстановитьПривилегированныйРежим(Истина);
	Объект.Статус = Неопределено;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ОтозватьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.ОтозватьЗаявку(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура СогласоватьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.СогласоватьЗаявку(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтклонитьЗаявкуНаСервере()
	
	СамообслуживаниеСотрудников.ОтклонитьЗаявку(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
